#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShopItem_Map_base

#include "Basic.hpp"

#include "MapDifficulty_structs.hpp"
#include "ShopItem_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ShopItem_Map_base.ShopItem_Map_base_C
// 0x0050 (0x02C0 - 0x0270)
class AShopItem_Map_base_C : public AShopItem_Base_C
{
public:
	class FString                                 Filename;                                          // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Cash_low_estimate;                                 // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Cash_high_estimate;                                // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EMapDifficulty                                Difficulty;                                        // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             MainObjectiveIcon;                                 // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             SketchIcon;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBaseMediaSource*                       MapTrailerMedia;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         Setups;                                            // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MinSetupsRequired;                                 // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ShopItem_Map_base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShopItem_Map_base_C")
	}
	static class AShopItem_Map_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShopItem_Map_base_C>();
	}
};
DUMPER7_ASSERTS_AShopItem_Map_base_C;

}

