#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamInventoryLibrary

#include "Basic.hpp"

#include "SteamCore_structs.hpp"


namespace SDK::Params
{

// Function SteamInventoryLibrary.SteamInventoryLibrary_C.PurchaseSteamItem
// 0x00C0 (0x00C0 - 0x0000)
struct SteamInventoryLibrary_C_PurchaseSteamItem final
{
public:
	class UClass*                                 BoughtSteamItem;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamItemDetails>              Result_items;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamInventoryResult                  Result;                                            // 0x0020(0x0004)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Success_;                                          // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemInstanceID                   CoinInstanceID;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemDetails                      CallFunc_Array_Get_Item;                           // 0x0040(0x0020)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemDef                          K2Node_MakeStruct_SteamItemDef;                    // 0x0064(0x0004)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamItemDef>                  K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Steam_Item_Coin_Price_Price;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamItemInstanceID>           K2Node_MakeArray_Array_1;                          // 0x0088(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x0098(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_3;                          // 0x00A8(0x0010)(ReferenceParm)
	struct FSteamInventoryResult                  CallFunc_ExchangeItems_Result;                     // 0x00B8(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExchangeItems_ReturnValue;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SteamInventoryLibrary_C_PurchaseSteamItem) == 0x000008, "Wrong alignment on SteamInventoryLibrary_C_PurchaseSteamItem");
static_assert(sizeof(SteamInventoryLibrary_C_PurchaseSteamItem) == 0x0000C0, "Wrong size on SteamInventoryLibrary_C_PurchaseSteamItem");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, BoughtSteamItem) == 0x000000, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::BoughtSteamItem' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, Result_items) == 0x000008, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::Result_items' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, __WorldContext) == 0x000018, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::__WorldContext' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, Result) == 0x000020, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::Result' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, Success_) == 0x000024, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::Success_' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CoinInstanceID) == 0x000028, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CoinInstanceID' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, Temp_int_Array_Index_Variable) == 0x000034, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CallFunc_Array_Get_Item) == 0x000040, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000060, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, K2Node_MakeStruct_SteamItemDef) == 0x000064, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::K2Node_MakeStruct_SteamItemDef' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, K2Node_MakeArray_Array) == 0x000068, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CallFunc_Get_Steam_Item_Coin_Price_Price) == 0x000084, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CallFunc_Get_Steam_Item_Coin_Price_Price' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, K2Node_MakeArray_Array_1) == 0x000088, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, K2Node_MakeArray_Array_2) == 0x000098, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, K2Node_MakeArray_Array_3) == 0x0000A8, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CallFunc_ExchangeItems_Result) == 0x0000B8, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CallFunc_ExchangeItems_Result' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_PurchaseSteamItem, CallFunc_ExchangeItems_ReturnValue) == 0x0000BC, "Member 'SteamInventoryLibrary_C_PurchaseSteamItem::CallFunc_ExchangeItems_ReturnValue' has a wrong offset!");

// Function SteamInventoryLibrary.SteamInventoryLibrary_C.DoesSteamInventoryContainItem?
// 0x0060 (0x0060 - 0x0000)
struct SteamInventoryLibrary_C_DoesSteamInventoryContainItem_ final
{
public:
	class UClass*                                 Inventory_item;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamItemDetails>              ResultItems;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ContainsItem;                                      // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamItemDetails                      CallFunc_Array_Get_Item;                           // 0x0030(0x0020)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_) == 0x000008, "Wrong alignment on SteamInventoryLibrary_C_DoesSteamInventoryContainItem_");
static_assert(sizeof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_) == 0x000060, "Wrong size on SteamInventoryLibrary_C_DoesSteamInventoryContainItem_");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, Inventory_item) == 0x000000, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::Inventory_item' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, ResultItems) == 0x000008, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::ResultItems' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, __WorldContext) == 0x000018, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::__WorldContext' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, Return) == 0x000020, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::Return' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, ContainsItem) == 0x000021, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::ContainsItem' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, CallFunc_Array_Get_Item) == 0x000030, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000054, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_DoesSteamInventoryContainItem_, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'SteamInventoryLibrary_C_DoesSteamInventoryContainItem_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function SteamInventoryLibrary.SteamInventoryLibrary_C.GetSteamItemsByCat
// 0x00F0 (0x00F0 - 0x0000)
struct SteamInventoryLibrary_C_GetSteamItemsByCat final
{
public:
	class FString                                 Item_cat;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamItemDetails>              Items;                                             // 0x0018(0x0010)(Parm, OutParm)
	bool                                          Success_;                                          // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemInstanceID>           Defininstion;                                      // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamInventoryResult                  CallFunc_GetItemsByID_InventoryResult;             // 0x004C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemsByID_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDetails>              CallFunc_GetResultItems_Items;                     // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetResultItems_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IControllerInterface_C> K2Node_DynamicCast_AsController_Interface;         // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDetails>              CallFunc_OnGetSteamInventoryItems_Items;           // 0x0090(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemDetails                      CallFunc_Array_Get_Item;                           // 0x00A8(0x0020)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetItemDefinitionProperty_Value;          // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemDefinitionProperty_ReturnValue;    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SteamInventoryLibrary_C_GetSteamItemsByCat) == 0x000008, "Wrong alignment on SteamInventoryLibrary_C_GetSteamItemsByCat");
static_assert(sizeof(SteamInventoryLibrary_C_GetSteamItemsByCat) == 0x0000F0, "Wrong size on SteamInventoryLibrary_C_GetSteamItemsByCat");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, Item_cat) == 0x000000, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::Item_cat' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, __WorldContext) == 0x000010, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::__WorldContext' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, Items) == 0x000018, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::Items' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, Success_) == 0x000028, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::Success_' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, Defininstion) == 0x000030, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::Defininstion' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, Temp_int_Array_Index_Variable) == 0x000040, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_GetItemsByID_InventoryResult) == 0x00004C, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_GetItemsByID_InventoryResult' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_GetItemsByID_ReturnValue) == 0x000050, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_GetItemsByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_GetResultItems_Items) == 0x000058, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_GetResultItems_Items' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_GetResultItems_ReturnValue) == 0x000068, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_GetResultItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, K2Node_DynamicCast_AsController_Interface) == 0x000078, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::K2Node_DynamicCast_AsController_Interface' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_OnGetSteamInventoryItems_Items) == 0x000090, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_OnGetSteamInventoryItems_Items' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_GetItemDefinitionProperty_Value) == 0x0000D0, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_GetItemDefinitionProperty_Value' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_GetItemDefinitionProperty_ReturnValue) == 0x0000E0, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_GetItemDefinitionProperty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_Array_Add_ReturnValue) == 0x0000E4, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByCat, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000E8, "Member 'SteamInventoryLibrary_C_GetSteamItemsByCat::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function SteamInventoryLibrary.SteamInventoryLibrary_C.GetSteamItemsByID
// 0x00C0 (0x00C0 - 0x0000)
struct SteamInventoryLibrary_C_GetSteamItemsByID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamItemDetails>              Items;                                             // 0x0010(0x0010)(Parm, OutParm)
	bool                                          Success_;                                          // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemInstanceID>           Defininstion;                                      // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IControllerInterface_C> K2Node_DynamicCast_AsController_Interface;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDetails>              CallFunc_OnGetSteamInventoryItems_Items;           // 0x0068(0x0010)(ReferenceParm)
	struct FSteamInventoryResult                  CallFunc_GetItemsByID_InventoryResult;             // 0x0078(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemsByID_ReturnValue;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemDetails                      CallFunc_Array_Get_Item;                           // 0x0080(0x0020)()
	TArray<struct FSteamItemDetails>              CallFunc_GetResultItems_Items;                     // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetResultItems_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SteamInventoryLibrary_C_GetSteamItemsByID) == 0x000008, "Wrong alignment on SteamInventoryLibrary_C_GetSteamItemsByID");
static_assert(sizeof(SteamInventoryLibrary_C_GetSteamItemsByID) == 0x0000C0, "Wrong size on SteamInventoryLibrary_C_GetSteamItemsByID");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, ID) == 0x000000, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::ID' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, __WorldContext) == 0x000008, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::__WorldContext' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, Items) == 0x000010, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::Items' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, Success_) == 0x000020, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::Success_' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, Defininstion) == 0x000028, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::Defininstion' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, Temp_int_Array_Index_Variable) == 0x000038, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, K2Node_DynamicCast_AsController_Interface) == 0x000050, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::K2Node_DynamicCast_AsController_Interface' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_OnGetSteamInventoryItems_Items) == 0x000068, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_OnGetSteamInventoryItems_Items' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_GetItemsByID_InventoryResult) == 0x000078, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_GetItemsByID_InventoryResult' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_GetItemsByID_ReturnValue) == 0x00007C, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_GetItemsByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_Array_Get_Item) == 0x000080, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_GetResultItems_Items) == 0x0000A0, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_GetResultItems_Items' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_GetResultItems_ReturnValue) == 0x0000B0, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_GetResultItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B1, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_GetSteamItemsByID, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'SteamInventoryLibrary_C_GetSteamItemsByID::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function SteamInventoryLibrary.SteamInventoryLibrary_C.UpdateSteamInventoryFromActionResult
// 0x0150 (0x0150 - 0x0000)
struct SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult final
{
public:
	struct FSteamInventoryResult                  Result;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDetails>              CurrentInventory;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamItemDetails>              UpdatedInventory;                                  // 0x0020(0x0010)(Parm, OutParm)
	struct FSteamInventoryResult                  Result_out;                                        // 0x0030(0x0004)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDetails>              NewInventory;                                      // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSteamItemDetails>              ChangedItems;                                      // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSteamItemDetails>              CallFunc_GetResultItems_Items;                     // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetResultItems_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemDetails                      CallFunc_Array_Get_Item;                           // 0x00A8(0x0020)()
	struct FSteamItemDetails                      CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemDetails                      CallFunc_Array_Get_Item_2;                         // 0x00F0(0x0020)()
	struct FSteamItemDetails                      CallFunc_Array_Get_Item_3;                         // 0x0110(0x0020)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult) == 0x000008, "Wrong alignment on SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult");
static_assert(sizeof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult) == 0x000150, "Wrong size on SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Result) == 0x000000, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Result' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CurrentInventory) == 0x000008, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CurrentInventory' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, __WorldContext) == 0x000018, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::__WorldContext' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, UpdatedInventory) == 0x000020, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::UpdatedInventory' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Result_out) == 0x000030, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Result_out' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, NewInventory) == 0x000038, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::NewInventory' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, ChangedItems) == 0x000048, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::ChangedItems' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_GetResultItems_Items) == 0x000058, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_GetResultItems_Items' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_GetResultItems_ReturnValue) == 0x000068, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_GetResultItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Temp_int_Array_Index_Variable) == 0x000080, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Temp_int_Loop_Counter_Variable_2) == 0x000084, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Add_IntInt_ReturnValue_2) == 0x000088, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Temp_int_Array_Index_Variable_1) == 0x00008C, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Temp_int_Array_Index_Variable_2) == 0x000090, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Temp_int_Loop_Counter_Variable_3) == 0x000094, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Add_IntInt_ReturnValue_3) == 0x00009C, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, Temp_int_Array_Index_Variable_3) == 0x0000A0, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000EC, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Get_Item_2) == 0x0000F0, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Get_Item_3) == 0x000110, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Add_ReturnValue) == 0x000130, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000134, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000135, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Length_ReturnValue_2) == 0x000138, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Less_IntInt_ReturnValue_2) == 0x00013C, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00013D, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Length_ReturnValue_3) == 0x000140, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Less_IntInt_ReturnValue_3) == 0x000144, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Add_ReturnValue_1) == 0x000148, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult, CallFunc_Array_Add_ReturnValue_2) == 0x00014C, "Member 'SteamInventoryLibrary_C_UpdateSteamInventoryFromActionResult::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function SteamInventoryLibrary.SteamInventoryLibrary_C.Get Steam Item Coin Price
// 0x0080 (0x0080 - 0x0000)
struct SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price final
{
public:
	class UClass*                                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Price;                                             // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CoinPrice;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDef>                  CallFunc_GetItemDefinitionIDs_ItemDefs;            // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetItemDefinitionIDs_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemDef                          CallFunc_Array_Get_Item;                           // 0x003C(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetItemDefinitionProperty_Value;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemDefinitionProperty_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price) == 0x000008, "Wrong alignment on SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price");
static_assert(sizeof(SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price) == 0x000080, "Wrong size on SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price");
static_assert(offsetof(SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price, Item) == 0x000000, "Member 'SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price::Item' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price, __WorldContext) == 0x000008, "Member 'SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price::__WorldContext' has a wrong offset!");
static_assert(offsetof(SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price, Price) == 0x000010, "Member 'SteamInventoryLibrary_C_Get_Steam_Item_Coin_Price::Price' has a wrong offset!");
